Revit 2024 API
ScheduleDefinition.IsKeySchedule Property
 Indicates if the schedule is a key schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsKeySchedule { get; }
Visual Basic
Public ReadOnly Property IsKeySchedule As Boolean
	Get
Visual C++
public:
property bool IsKeySchedule {
	bool get ();
}
Remarks
 A key schedule displays abstract "key" elements that can be used to populate parameters of ordinary model elements.
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace